docs/protocol/transactions/graphs/00_escrow_lock_provider.mmd
stateDiagram-v2
    [*] --> IDLE
    IDLE --> VALIDATING_CHECKPOINT : LOCK_INTENT
    VALIDATING_CHECKPOINT --> SELECTING_WITNESSES : [auto]\n[CHAIN_CONTAINS_HASH (my_chain,...]
    SENDING_REJECTION --> IDLE : [auto]
    SELECTING_WITNESSES --> SENDING_COMMITMENT : [auto]
    SENDING_COMMITMENT --> WAITING_FOR_LOCK : [auto]
    WAITING_FOR_LOCK --> SERVICE_PHASE : BALANCE_UPDATE_BROADCAST\n[message.lock_result.session_id...]
    WAITING_FOR_LOCK --> IDLE : timeout(LOCK_TIMEOUT)
